Catalogs/КодыДокументовКадровыхМероприятий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Catalog>
		<Properties>
			<Name>КодыДокументовКадровыхМероприятий</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СсылкаНаНД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/КодыДокументовКадровыхМероприятий/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// ТехнологияСервиса.ВыгрузкаЗагрузкаДанных

// Возвращает реквизиты справочника, которые образуют естественный ключ для элементов справочника.
//
// Возвращаемое значение:
//  Массив из Строка - имена реквизитов, образующих естественный ключ.
//
Функция ПоляЕстественногоКлюча() Экспорт
	
	Результат = Новый Массив;
	
	Результат.Добавить("Код");
	
	Возврат Результат;
	
КонецФункции

// Конец ТехнологияСервиса.ВыгрузкаЗагрузкаДанных

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ПервоначальноеЗаполнениеИОбновлениеИнформационнойБазы

// Процедура выполняет первоначальное заполнение статей ТК - оснований увольнения.
Процедура НачальноеЗаполнение() Экспорт
	
	ЗагрузитьКлассификатор();
	
КонецПроцедуры

Процедура ЗагрузитьКлассификатор() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	КодыДокументовКадровыхМероприятий.Ссылка КАК Ссылка,
		|	КодыДокументовКадровыхМероприятий.Код КАК Код
		|ИЗ
		|	Справочник.КодыДокументовКадровыхМероприятий КАК КодыДокументовКадровыхМероприятий";
	
	Классификатор = Запрос.Выполнить().Выгрузить();
	
	ДанныеМакетаКлассификатора = ОбщегоНазначения.ПрочитатьXMLВТаблицу(
		ПолучитьМакет("КодыДокументовКадровыхМероприятий").ПолучитьТекст()).Данные;
	
	Для Каждого СтрокаКалсссификатора Из ДанныеМакетаКлассификатора Цикл
		
		ЭтоГруппаКлассификатора = СтрокаКалсссификатора.ParentCode = "";
		ЭтоНовыйЭлемент = Ложь;
		
		СтрокаСсылки = Классификатор.Найти(СтрокаКалсссификатора.Code, "Код");
		Если СтрокаСсылки = Неопределено Тогда
			ЭтоНовыйЭлемент = Истина;
			Если ЭтоГруппаКлассификатора Тогда
				ОбъектСсылки = Справочники.КодыДокументовКадровыхМероприятий.СоздатьГруппу();
			Иначе
				ОбъектСсылки = Справочники.КодыДокументовКадровыхМероприятий.СоздатьЭлемент();
			КонецЕсли;
			ОбъектСсылки.Код = СтрокаКалсссификатора.Code;
		Иначе
			ОбъектСсылки = СтрокаСсылки.Ссылка.ПолучитьОбъект();
		КонецЕсли;
		ОбъектСсылки.НаименованиеПолное = СтрокаКалсссификатора.Name;
		Если Не ЭтоГруппаКлассификатора Тогда
			ОбъектСсылки.СсылкаНаНД = СтрокаКалсссификатора.Article;
			ОбъектСсылки.ИмяПредопределенныхДанных = СтрокаКалсссификатора.Id;
			СтрокаРодителя = Классификатор.Найти(СтрокаКалсссификатора.ParentCode, "Код");
			Если СтрокаРодителя <> Неопределено Тогда
				ОбъектСсылки.Родитель = СтрокаРодителя.Ссылка;
			КонецЕсли;
		КонецЕсли;
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ОбъектСсылки);
		Если ЭтоНовыйЭлемент Тогда
			НоваяСтрокаКлассификатора = Классификатор.Добавить();
			НоваяСтрокаКлассификатора.Код = ОбъектСсылки.Код;
			НоваяСтрокаКлассификатора.Ссылка = ОбъектСсылки.Ссылка;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
